loadtest/results/compose-spike.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/spike-load.js
        output: Prometheus remote write (http://localhost:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 400 max VUs, 3m25s max duration (incl. graceful stop):
              * mixed_traffic: Up to 400 looping VUs for 3m20s over 7 stages (gracefulRampDown: 5s, gracefulStop: 30s)


Run             [ 100% ] setup()
mixed_traffic   [   0% ]

Run             [ 100% ] setup()
mixed_traffic   [   0% ]

Run             [ 100% ] setup()
mixed_traffic   [   0% ]
time="2026-07-23T14:08:18-05:00" level=info msg="setup complete: productId=d3741d0c-6949-47f9-9048-3fa015b3a1a5, repeatCustomers=10" source=console

running (0m04.0s), 000/400 VUs, 0 complete and 0 interrupted iterations
mixed_traffic   [   0% ] 000/400 VUs  0m00.6s/3m20.0s

running (0m05.0s), 001/400 VUs, 0 complete and 0 interrupted iterations
mixed_traffic   [   1% ] 001/400 VUs  0m01.6s/3m20.0s

running (0m06.0s), 001/400 VUs, 2 complete and 0 interrupted iterations
mixed_traffic   [   1% ] 001/400 VUs  0m02.6s/3m20.0s

running (0m07.0s), 002/400 VUs, 4 complete and 0 interrupted iterations
mixed_traffic   [   2% ] 002/400 VUs  0m03.6s/3m20.0s

running (0m08.0s), 003/400 VUs, 7 complete and 0 interrupted iterations
mixed_traffic   [   2% ] 003/400 VUs  0m04.6s/3m20.0s

running (0m09.0s), 004/400 VUs, 11 complete and 0 interrupted iterations
mixed_traffic   [   3% ] 004/400 VUs  0m05.6s/3m20.0s

running (0m10.0s), 004/400 VUs, 18 complete and 0 interrupted iterations
mixed_traffic   [   3% ] 004/400 VUs  0m06.6s/3m20.0s

running (0m11.0s), 005/400 VUs, 25 complete and 0 interrupted iterations
mixed_traffic   [   4% ] 005/400 VUs  0m07.6s/3m20.0s

running (0m12.0s), 006/400 VUs, 34 complete and 0 interrupted iterations
mixed_traffic   [   4% ] 006/400 VUs  0m08.6s/3m20.0s

running (0m13.0s), 007/400 VUs, 44 complete and 0 interrupted iterations
mixed_traffic   [   5% ] 007/400 VUs  0m09.6s/3m20.0s

running (0m14.0s), 007/400 VUs, 54 complete and 0 interrupted iterations
mixed_traffic   [   5% ] 007/400 VUs  0m10.6s/3m20.0s

running (0m15.0s), 008/400 VUs, 70 complete and 0 interrupted iterations
mixed_traffic   [   6% ] 008/400 VUs  0m11.6s/3m20.0s

running (0m16.0s), 009/400 VUs, 82 complete and 0 interrupted iterations
mixed_traffic   [   6% ] 009/400 VUs  0m12.6s/3m20.0s

running (0m17.0s), 010/400 VUs, 95 complete and 0 interrupted iterations
mixed_traffic   [   7% ] 010/400 VUs  0m13.6s/3m20.0s

running (0m18.0s), 010/400 VUs, 112 complete and 0 interrupted iterations
mixed_traffic   [   7% ] 010/400 VUs  0m14.6s/3m20.0s

running (0m19.0s), 011/400 VUs, 130 complete and 0 interrupted iterations
mixed_traffic   [   8% ] 011/400 VUs  0m15.6s/3m20.0s

running (0m20.0s), 012/400 VUs, 145 complete and 0 interrupted iterations
mixed_traffic   [   8% ] 012/400 VUs  0m16.6s/3m20.0s

running (0m21.0s), 013/400 VUs, 166 complete and 0 interrupted iterations
mixed_traffic   [   9% ] 013/400 VUs  0m17.6s/3m20.0s

running (0m22.0s), 013/400 VUs, 186 complete and 0 interrupted iterations
mixed_traffic   [   9% ] 013/400 VUs  0m18.6s/3m20.0s

running (0m23.0s), 014/400 VUs, 211 complete and 0 interrupted iterations
mixed_traffic   [  10% ] 014/400 VUs  0m19.6s/3m20.0s

running (0m24.0s), 015/400 VUs, 233 complete and 0 interrupted iterations
mixed_traffic   [  10% ] 015/400 VUs  0m20.6s/3m20.0s

running (0m25.0s), 015/400 VUs, 257 complete and 0 interrupted iterations
mixed_traffic   [  11% ] 015/400 VUs  0m21.6s/3m20.0s

running (0m26.0s), 015/400 VUs, 281 complete and 0 interrupted iterations
mixed_traffic   [  11% ] 015/400 VUs  0m22.6s/3m20.0s

running (0m27.0s), 015/400 VUs, 311 complete and 0 interrupted iterations
mixed_traffic   [  12% ] 015/400 VUs  0m23.6s/3m20.0s

running (0m28.0s), 015/400 VUs, 336 complete and 0 interrupted iterations
mixed_traffic   [  12% ] 015/400 VUs  0m24.6s/3m20.0s

running (0m29.0s), 015/400 VUs, 365 complete and 0 interrupted iterations
mixed_traffic   [  13% ] 015/400 VUs  0m25.6s/3m20.0s

running (0m30.0s), 015/400 VUs, 392 complete and 0 interrupted iterations
mixed_traffic   [  13% ] 015/400 VUs  0m26.6s/3m20.0s

running (0m31.0s), 015/400 VUs, 418 complete and 0 interrupted iterations
mixed_traffic   [  14% ] 015/400 VUs  0m27.6s/3m20.0s

running (0m32.0s), 015/400 VUs, 443 complete and 0 interrupted iterations
mixed_traffic   [  14% ] 015/400 VUs  0m28.6s/3m20.0s

running (0m33.0s), 015/400 VUs, 466 complete and 0 interrupted iterations
mixed_traffic   [  15% ] 015/400 VUs  0m29.6s/3m20.0s

running (0m34.0s), 015/400 VUs, 495 complete and 0 interrupted iterations
mixed_traffic   [  15% ] 015/400 VUs  0m30.6s/3m20.0s

running (0m35.0s), 015/400 VUs, 521 complete and 0 interrupted iterations
mixed_traffic   [  16% ] 015/400 VUs  0m31.6s/3m20.0s

running (0m36.0s), 015/400 VUs, 550 complete and 0 interrupted iterations
mixed_traffic   [  16% ] 015/400 VUs  0m32.6s/3m20.0s

running (0m37.0s), 015/400 VUs, 579 complete and 0 interrupted iterations
mixed_traffic   [  17% ] 015/400 VUs  0m33.6s/3m20.0s

running (0m38.0s), 015/400 VUs, 604 complete and 0 interrupted iterations
mixed_traffic   [  17% ] 015/400 VUs  0m34.6s/3m20.0s

running (0m39.0s), 015/400 VUs, 626 complete and 0 interrupted iterations
mixed_traffic   [  18% ] 015/400 VUs  0m35.6s/3m20.0s

running (0m40.0s), 015/400 VUs, 654 complete and 0 interrupted iterations
mixed_traffic   [  18% ] 015/400 VUs  0m36.6s/3m20.0s

running (0m41.0s), 015/400 VUs, 685 complete and 0 interrupted iterations
mixed_traffic   [  19% ] 015/400 VUs  0m37.6s/3m20.0s

running (0m42.0s), 015/400 VUs, 710 complete and 0 interrupted iterations
mixed_traffic   [  19% ] 015/400 VUs  0m38.6s/3m20.0s

running (0m43.0s), 015/400 VUs, 733 complete and 0 interrupted iterations
mixed_traffic   [  20% ] 015/400 VUs  0m39.6s/3m20.0s

running (0m44.0s), 015/400 VUs, 763 complete and 0 interrupted iterations
mixed_traffic   [  20% ] 015/400 VUs  0m40.6s/3m20.0s

running (0m45.0s), 015/400 VUs, 789 complete and 0 interrupted iterations
mixed_traffic   [  21% ] 015/400 VUs  0m41.6s/3m20.0s

running (0m46.0s), 015/400 VUs, 811 complete and 0 interrupted iterations
mixed_traffic   [  21% ] 015/400 VUs  0m42.6s/3m20.0s

running (0m47.0s), 015/400 VUs, 837 complete and 0 interrupted iterations
mixed_traffic   [  22% ] 015/400 VUs  0m43.6s/3m20.0s

running (0m48.0s), 015/400 VUs, 864 complete and 0 interrupted iterations
mixed_traffic   [  22% ] 015/400 VUs  0m44.6s/3m20.0s

running (0m49.0s), 015/400 VUs, 883 complete and 0 interrupted iterations
mixed_traffic   [  23% ] 015/400 VUs  0m45.6s/3m20.0s

running (0m50.0s), 015/400 VUs, 907 complete and 0 interrupted iterations
mixed_traffic   [  23% ] 015/400 VUs  0m46.6s/3m20.0s

running (0m51.0s), 015/400 VUs, 933 complete and 0 interrupted iterations
mixed_traffic   [  24% ] 015/400 VUs  0m47.6s/3m20.0s

running (0m52.0s), 015/400 VUs, 960 complete and 0 interrupted iterations
mixed_traffic   [  24% ] 015/400 VUs  0m48.6s/3m20.0s

running (0m53.0s), 015/400 VUs, 984 complete and 0 interrupted iterations
mixed_traffic   [  25% ] 015/400 VUs  0m49.6s/3m20.0s

running (0m54.0s), 015/400 VUs, 1012 complete and 0 interrupted iterations
mixed_traffic   [  25% ] 015/400 VUs  0m50.6s/3m20.0s

running (0m55.0s), 015/400 VUs, 1035 complete and 0 interrupted iterations
mixed_traffic   [  26% ] 015/400 VUs  0m51.6s/3m20.0s

running (0m56.0s), 015/400 VUs, 1060 complete and 0 interrupted iterations
mixed_traffic   [  26% ] 015/400 VUs  0m52.6s/3m20.0s

running (0m57.0s), 015/400 VUs, 1091 complete and 0 interrupted iterations
mixed_traffic   [  27% ] 015/400 VUs  0m53.6s/3m20.0s

running (0m58.0s), 015/400 VUs, 1117 complete and 0 interrupted iterations
mixed_traffic   [  27% ] 015/400 VUs  0m54.6s/3m20.0s

running (0m59.0s), 015/400 VUs, 1136 complete and 0 interrupted iterations
mixed_traffic   [  28% ] 015/400 VUs  0m55.6s/3m20.0s

running (1m00.0s), 015/400 VUs, 1168 complete and 0 interrupted iterations
mixed_traffic   [  28% ] 015/400 VUs  0m56.6s/3m20.0s

running (1m01.0s), 015/400 VUs, 1194 complete and 0 interrupted iterations
mixed_traffic   [  29% ] 015/400 VUs  0m57.6s/3m20.0s

running (1m02.0s), 015/400 VUs, 1222 complete and 0 interrupted iterations
mixed_traffic   [  29% ] 015/400 VUs  0m58.6s/3m20.0s

running (1m03.0s), 015/400 VUs, 1244 complete and 0 interrupted iterations
mixed_traffic   [  30% ] 015/400 VUs  0m59.6s/3m20.0s

running (1m04.0s), 058/400 VUs, 1275 complete and 0 interrupted iterations
mixed_traffic   [  30% ] 058/400 VUs  1m00.6s/3m20.0s

running (1m05.0s), 135/400 VUs, 1413 complete and 0 interrupted iterations
mixed_traffic   [  31% ] 135/400 VUs  1m01.6s/3m20.0s

running (1m06.0s), 212/400 VUs, 1717 complete and 0 interrupted iterations
mixed_traffic   [  31% ] 212/400 VUs  1m02.6s/3m20.0s

running (1m07.0s), 289/400 VUs, 2220 complete and 0 interrupted iterations
mixed_traffic   [  32% ] 289/400 VUs  1m03.6s/3m20.0s

running (1m08.0s), 366/400 VUs, 2902 complete and 0 interrupted iterations
mixed_traffic   [  32% ] 366/400 VUs  1m04.6s/3m20.0s

running (1m09.0s), 400/400 VUs, 3752 complete and 0 interrupted iterations
mixed_traffic   [  33% ] 400/400 VUs  1m05.6s/3m20.0s

running (1m10.0s), 400/400 VUs, 4620 complete and 0 interrupted iterations
mixed_traffic   [  33% ] 400/400 VUs  1m06.6s/3m20.0s

running (1m11.0s), 400/400 VUs, 5498 complete and 0 interrupted iterations
mixed_traffic   [  34% ] 400/400 VUs  1m07.6s/3m20.0s

running (1m12.0s), 400/400 VUs, 6400 complete and 0 interrupted iterations
mixed_traffic   [  34% ] 400/400 VUs  1m08.6s/3m20.0s

running (1m13.0s), 400/400 VUs, 7270 complete and 0 interrupted iterations
mixed_traffic   [  35% ] 400/400 VUs  1m09.6s/3m20.0s

running (1m14.0s), 400/400 VUs, 8136 complete and 0 interrupted iterations
mixed_traffic   [  35% ] 400/400 VUs  1m10.6s/3m20.0s

running (1m15.0s), 400/400 VUs, 9029 complete and 0 interrupted iterations
mixed_traffic   [  36% ] 400/400 VUs  1m11.6s/3m20.0s

running (1m16.0s), 400/400 VUs, 9862 complete and 0 interrupted iterations
mixed_traffic   [  36% ] 400/400 VUs  1m12.6s/3m20.0s

running (1m17.0s), 400/400 VUs, 10686 complete and 0 interrupted iterations
mixed_traffic   [  37% ] 400/400 VUs  1m13.6s/3m20.0s

running (1m18.0s), 400/400 VUs, 11574 complete and 0 interrupted iterations
mixed_traffic   [  37% ] 400/400 VUs  1m14.6s/3m20.0s

running (1m19.0s), 400/400 VUs, 12455 complete and 0 interrupted iterations
mixed_traffic   [  38% ] 400/400 VUs  1m15.6s/3m20.0s

running (1m20.0s), 400/400 VUs, 13327 complete and 0 interrupted iterations
mixed_traffic   [  38% ] 400/400 VUs  1m16.6s/3m20.0s

running (1m21.0s), 400/400 VUs, 14186 complete and 0 interrupted iterations
mixed_traffic   [  39% ] 400/400 VUs  1m17.6s/3m20.0s

running (1m22.0s), 400/400 VUs, 15082 complete and 0 interrupted iterations
mixed_traffic   [  39% ] 400/400 VUs  1m18.6s/3m20.0s

running (1m23.0s), 400/400 VUs, 15971 complete and 0 interrupted iterations
mixed_traffic   [  40% ] 400/400 VUs  1m19.6s/3m20.0s

running (1m24.0s), 400/400 VUs, 16847 complete and 0 interrupted iterations
mixed_traffic   [  40% ] 400/400 VUs  1m20.6s/3m20.0s

running (1m25.0s), 400/400 VUs, 17726 complete and 0 interrupted iterations
mixed_traffic   [  41% ] 400/400 VUs  1m21.6s/3m20.0s

running (1m26.0s), 400/400 VUs, 18574 complete and 0 interrupted iterations
mixed_traffic   [  41% ] 400/400 VUs  1m22.6s/3m20.0s

running (1m27.0s), 400/400 VUs, 19370 complete and 0 interrupted iterations
mixed_traffic   [  42% ] 400/400 VUs  1m23.6s/3m20.0s

running (1m28.0s), 400/400 VUs, 20281 complete and 0 interrupted iterations
mixed_traffic   [  42% ] 400/400 VUs  1m24.6s/3m20.0s

running (1m29.0s), 400/400 VUs, 21162 complete and 0 interrupted iterations
mixed_traffic   [  43% ] 400/400 VUs  1m25.6s/3m20.0s

running (1m30.0s), 400/400 VUs, 22050 complete and 0 interrupted iterations
mixed_traffic   [  43% ] 400/400 VUs  1m26.6s/3m20.0s

running (1m31.0s), 400/400 VUs, 22925 complete and 0 interrupted iterations
mixed_traffic   [  44% ] 400/400 VUs  1m27.6s/3m20.0s

running (1m32.0s), 400/400 VUs, 23794 complete and 0 interrupted iterations
mixed_traffic   [  44% ] 400/400 VUs  1m28.6s/3m20.0s

running (1m33.0s), 400/400 VUs, 24681 complete and 0 interrupted iterations
mixed_traffic   [  45% ] 400/400 VUs  1m29.6s/3m20.0s

running (1m34.0s), 400/400 VUs, 25568 complete and 0 interrupted iterations
mixed_traffic   [  45% ] 400/400 VUs  1m30.6s/3m20.0s

running (1m35.0s), 400/400 VUs, 26469 complete and 0 interrupted iterations
mixed_traffic   [  46% ] 400/400 VUs  1m31.6s/3m20.0s

running (1m36.0s), 400/400 VUs, 27328 complete and 0 interrupted iterations
mixed_traffic   [  46% ] 400/400 VUs  1m32.6s/3m20.0s

running (1m37.0s), 400/400 VUs, 28135 complete and 0 interrupted iterations
mixed_traffic   [  47% ] 400/400 VUs  1m33.6s/3m20.0s

running (1m38.0s), 400/400 VUs, 28980 complete and 0 interrupted iterations
mixed_traffic   [  47% ] 400/400 VUs  1m34.6s/3m20.0s

running (1m39.0s), 400/400 VUs, 29871 complete and 0 interrupted iterations
mixed_traffic   [  48% ] 400/400 VUs  1m35.6s/3m20.0s

running (1m40.0s), 400/400 VUs, 30762 complete and 0 interrupted iterations
mixed_traffic   [  48% ] 400/400 VUs  1m36.6s/3m20.0s

running (1m41.0s), 400/400 VUs, 31650 complete and 0 interrupted iterations
mixed_traffic   [  49% ] 400/400 VUs  1m37.6s/3m20.0s

running (1m42.0s), 400/400 VUs, 32542 complete and 0 interrupted iterations
mixed_traffic   [  49% ] 400/400 VUs  1m38.6s/3m20.0s

running (1m43.0s), 400/400 VUs, 33420 complete and 0 interrupted iterations
mixed_traffic   [  50% ] 400/400 VUs  1m39.6s/3m20.0s

running (1m44.0s), 400/400 VUs, 34317 complete and 0 interrupted iterations
mixed_traffic   [  50% ] 400/400 VUs  1m40.6s/3m20.0s

running (1m45.0s), 400/400 VUs, 35198 complete and 0 interrupted iterations
mixed_traffic   [  51% ] 400/400 VUs  1m41.6s/3m20.0s

running (1m46.0s), 400/400 VUs, 36080 complete and 0 interrupted iterations
mixed_traffic   [  51% ] 400/400 VUs  1m42.6s/3m20.0s

running (1m47.0s), 400/400 VUs, 36955 complete and 0 interrupted iterations
mixed_traffic   [  52% ] 400/400 VUs  1m43.6s/3m20.0s

running (1m48.0s), 400/400 VUs, 37762 complete and 0 interrupted iterations
mixed_traffic   [  52% ] 400/400 VUs  1m44.6s/3m20.0s

running (1m49.0s), 400/400 VUs, 38616 complete and 0 interrupted iterations
mixed_traffic   [  53% ] 400/400 VUs  1m45.6s/3m20.0s

running (1m50.0s), 400/400 VUs, 39497 complete and 0 interrupted iterations
mixed_traffic   [  53% ] 400/400 VUs  1m46.6s/3m20.0s

running (1m51.0s), 400/400 VUs, 40385 complete and 0 interrupted iterations
mixed_traffic   [  54% ] 400/400 VUs  1m47.6s/3m20.0s

running (1m52.0s), 400/400 VUs, 41279 complete and 0 interrupted iterations
mixed_traffic   [  54% ] 400/400 VUs  1m48.6s/3m20.0s

running (1m53.0s), 400/400 VUs, 42169 complete and 0 interrupted iterations
mixed_traffic   [  55% ] 400/400 VUs  1m49.6s/3m20.0s

running (1m54.0s), 387/400 VUs, 43062 complete and 0 interrupted iterations
mixed_traffic   [  55% ] 387/400 VUs  1m50.6s/3m20.0s

running (1m55.0s), 349/400 VUs, 43877 complete and 0 interrupted iterations
mixed_traffic   [  56% ] 349/400 VUs  1m51.6s/3m20.0s

running (1m56.0s), 309/400 VUs, 44622 complete and 0 interrupted iterations
mixed_traffic   [  56% ] 309/400 VUs  1m52.6s/3m20.0s

running (1m57.0s), 276/400 VUs, 45274 complete and 0 interrupted iterations
mixed_traffic   [  57% ] 276/400 VUs  1m53.6s/3m20.0s

running (1m58.0s), 238/400 VUs, 45808 complete and 0 interrupted iterations
mixed_traffic   [  57% ] 238/400 VUs  1m54.6s/3m20.0s

running (1m59.0s), 197/400 VUs, 46273 complete and 0 interrupted iterations
mixed_traffic   [  58% ] 197/400 VUs  1m55.6s/3m20.0s

running (2m00.0s), 156/400 VUs, 46672 complete and 0 interrupted iterations
mixed_traffic   [  58% ] 156/400 VUs  1m56.6s/3m20.0s

running (2m01.0s), 117/400 VUs, 46996 complete and 0 interrupted iterations
mixed_traffic   [  59% ] 117/400 VUs  1m57.6s/3m20.0s

running (2m02.0s), 080/400 VUs, 47235 complete and 0 interrupted iterations
mixed_traffic   [  59% ] 080/400 VUs  1m58.6s/3m20.0s

running (2m03.0s), 042/400 VUs, 47379 complete and 0 interrupted iterations
mixed_traffic   [  60% ] 042/400 VUs  1m59.6s/3m20.0s

running (2m04.0s), 016/400 VUs, 47447 complete and 0 interrupted iterations
mixed_traffic   [  60% ] 016/400 VUs  2m00.6s/3m20.0s

running (2m05.0s), 015/400 VUs, 47476 complete and 0 interrupted iterations
mixed_traffic   [  61% ] 015/400 VUs  2m01.6s/3m20.0s

running (2m06.0s), 015/400 VUs, 47511 complete and 0 interrupted iterations
mixed_traffic   [  61% ] 015/400 VUs  2m02.6s/3m20.0s

running (2m07.0s), 015/400 VUs, 47544 complete and 0 interrupted iterations
mixed_traffic   [  62% ] 015/400 VUs  2m03.6s/3m20.0s

running (2m08.0s), 015/400 VUs, 47570 complete and 0 interrupted iterations
mixed_traffic   [  62% ] 015/400 VUs  2m04.6s/3m20.0s

running (2m09.0s), 015/400 VUs, 47600 complete and 0 interrupted iterations
mixed_traffic   [  63% ] 015/400 VUs  2m05.6s/3m20.0s

running (2m10.0s), 015/400 VUs, 47632 complete and 0 interrupted iterations
mixed_traffic   [  63% ] 015/400 VUs  2m06.6s/3m20.0s

running (2m11.0s), 015/400 VUs, 47658 complete and 0 interrupted iterations
mixed_traffic   [  64% ] 015/400 VUs  2m07.6s/3m20.0s

running (2m12.0s), 015/400 VUs, 47680 complete and 0 interrupted iterations
mixed_traffic   [  64% ] 015/400 VUs  2m08.6s/3m20.0s

running (2m13.0s), 015/400 VUs, 47704 complete and 0 interrupted iterations
mixed_traffic   [  65% ] 015/400 VUs  2m09.6s/3m20.0s

running (2m14.0s), 015/400 VUs, 47734 complete and 0 interrupted iterations
mixed_traffic   [  65% ] 015/400 VUs  2m10.6s/3m20.0s

running (2m15.0s), 015/400 VUs, 47758 complete and 0 interrupted iterations
mixed_traffic   [  66% ] 015/400 VUs  2m11.6s/3m20.0s

running (2m16.0s), 015/400 VUs, 47787 complete and 0 interrupted iterations
mixed_traffic   [  66% ] 015/400 VUs  2m12.6s/3m20.0s

running (2m17.0s), 015/400 VUs, 47813 complete and 0 interrupted iterations
mixed_traffic   [  67% ] 015/400 VUs  2m13.6s/3m20.0s

running (2m18.0s), 015/400 VUs, 47842 complete and 0 interrupted iterations
mixed_traffic   [  67% ] 015/400 VUs  2m14.6s/3m20.0s

running (2m19.0s), 015/400 VUs, 47864 complete and 0 interrupted iterations
mixed_traffic   [  68% ] 015/400 VUs  2m15.6s/3m20.0s

running (2m20.0s), 015/400 VUs, 47890 complete and 0 interrupted iterations
mixed_traffic   [  68% ] 015/400 VUs  2m16.6s/3m20.0s

running (2m21.0s), 015/400 VUs, 47916 complete and 0 interrupted iterations
mixed_traffic   [  69% ] 015/400 VUs  2m17.6s/3m20.0s

running (2m22.0s), 015/400 VUs, 47943 complete and 0 interrupted iterations
mixed_traffic   [  69% ] 015/400 VUs  2m18.6s/3m20.0s

running (2m23.0s), 015/400 VUs, 47966 complete and 0 interrupted iterations
mixed_traffic   [  70% ] 015/400 VUs  2m19.6s/3m20.0s

running (2m24.0s), 015/400 VUs, 47990 complete and 0 interrupted iterations
mixed_traffic   [  70% ] 015/400 VUs  2m20.6s/3m20.0s

running (2m25.0s), 015/400 VUs, 48014 complete and 0 interrupted iterations
mixed_traffic   [  71% ] 015/400 VUs  2m21.6s/3m20.0s

running (2m26.0s), 015/400 VUs, 48035 complete and 0 interrupted iterations
mixed_traffic   [  71% ] 015/400 VUs  2m22.6s/3m20.0s

running (2m27.0s), 015/400 VUs, 48061 complete and 0 interrupted iterations
mixed_traffic   [  72% ] 015/400 VUs  2m23.6s/3m20.0s

running (2m28.0s), 015/400 VUs, 48089 complete and 0 interrupted iterations
mixed_traffic   [  72% ] 015/400 VUs  2m24.6s/3m20.0s

running (2m29.0s), 015/400 VUs, 48115 complete and 0 interrupted iterations
mixed_traffic   [  73% ] 015/400 VUs  2m25.6s/3m20.0s

running (2m30.0s), 015/400 VUs, 48142 complete and 0 interrupted iterations
mixed_traffic   [  73% ] 015/400 VUs  2m26.6s/3m20.0s

running (2m31.0s), 015/400 VUs, 48171 complete and 0 interrupted iterations
mixed_traffic   [  74% ] 015/400 VUs  2m27.6s/3m20.0s

running (2m32.0s), 015/400 VUs, 48194 complete and 0 interrupted iterations
mixed_traffic   [  74% ] 015/400 VUs  2m28.6s/3m20.0s

running (2m33.0s), 015/400 VUs, 48225 complete and 0 interrupted iterations
mixed_traffic   [  75% ] 015/400 VUs  2m29.6s/3m20.0s

running (2m34.0s), 015/400 VUs, 48251 complete and 0 interrupted iterations
mixed_traffic   [  75% ] 015/400 VUs  2m30.6s/3m20.0s

running (2m35.0s), 015/400 VUs, 48278 complete and 0 interrupted iterations
mixed_traffic   [  76% ] 015/400 VUs  2m31.6s/3m20.0s

running (2m36.0s), 015/400 VUs, 48304 complete and 0 interrupted iterations
mixed_traffic   [  76% ] 015/400 VUs  2m32.6s/3m20.0s

running (2m37.0s), 015/400 VUs, 48330 complete and 0 interrupted iterations
mixed_traffic   [  77% ] 015/400 VUs  2m33.6s/3m20.0s

running (2m38.0s), 015/400 VUs, 48357 complete and 0 interrupted iterations
mixed_traffic   [  77% ] 015/400 VUs  2m34.6s/3m20.0s

running (2m39.0s), 015/400 VUs, 48382 complete and 0 interrupted iterations
mixed_traffic   [  78% ] 015/400 VUs  2m35.6s/3m20.0s

running (2m40.0s), 015/400 VUs, 48411 complete and 0 interrupted iterations
mixed_traffic   [  78% ] 015/400 VUs  2m36.6s/3m20.0s

running (2m41.0s), 015/400 VUs, 48434 complete and 0 interrupted iterations
mixed_traffic   [  79% ] 015/400 VUs  2m37.6s/3m20.0s

running (2m42.0s), 015/400 VUs, 48465 complete and 0 interrupted iterations
mixed_traffic   [  79% ] 015/400 VUs  2m38.6s/3m20.0s

running (2m43.0s), 015/400 VUs, 48489 complete and 0 interrupted iterations
mixed_traffic   [  80% ] 015/400 VUs  2m39.6s/3m20.0s

running (2m44.0s), 015/400 VUs, 48515 complete and 0 interrupted iterations
mixed_traffic   [  80% ] 015/400 VUs  2m40.6s/3m20.0s

running (2m45.0s), 015/400 VUs, 48541 complete and 0 interrupted iterations
mixed_traffic   [  81% ] 015/400 VUs  2m41.6s/3m20.0s

running (2m46.0s), 015/400 VUs, 48568 complete and 0 interrupted iterations
mixed_traffic   [  81% ] 015/400 VUs  2m42.6s/3m20.0s

running (2m47.0s), 015/400 VUs, 48593 complete and 0 interrupted iterations
mixed_traffic   [  82% ] 015/400 VUs  2m43.6s/3m20.0s

running (2m48.0s), 015/400 VUs, 48616 complete and 0 interrupted iterations
mixed_traffic   [  82% ] 015/400 VUs  2m44.6s/3m20.0s

running (2m49.0s), 015/400 VUs, 48647 complete and 0 interrupted iterations
mixed_traffic   [  83% ] 015/400 VUs  2m45.6s/3m20.0s

running (2m50.0s), 015/400 VUs, 48674 complete and 0 interrupted iterations
mixed_traffic   [  83% ] 015/400 VUs  2m46.6s/3m20.0s

running (2m51.0s), 015/400 VUs, 48700 complete and 0 interrupted iterations
mixed_traffic   [  84% ] 015/400 VUs  2m47.6s/3m20.0s

running (2m52.0s), 015/400 VUs, 48722 complete and 0 interrupted iterations
mixed_traffic   [  84% ] 015/400 VUs  2m48.6s/3m20.0s

running (2m53.0s), 015/400 VUs, 48749 complete and 0 interrupted iterations
mixed_traffic   [  85% ] 015/400 VUs  2m49.6s/3m20.0s

running (2m54.0s), 015/400 VUs, 48775 complete and 0 interrupted iterations
mixed_traffic   [  85% ] 015/400 VUs  2m50.6s/3m20.0s

running (2m55.0s), 015/400 VUs, 48799 complete and 0 interrupted iterations
mixed_traffic   [  86% ] 015/400 VUs  2m51.6s/3m20.0s

running (2m56.0s), 015/400 VUs, 48829 complete and 0 interrupted iterations
mixed_traffic   [  86% ] 015/400 VUs  2m52.6s/3m20.0s

running (2m57.0s), 015/400 VUs, 48852 complete and 0 interrupted iterations
mixed_traffic   [  87% ] 015/400 VUs  2m53.6s/3m20.0s

running (2m58.0s), 015/400 VUs, 48883 complete and 0 interrupted iterations
mixed_traffic   [  87% ] 015/400 VUs  2m54.6s/3m20.0s

running (2m59.0s), 015/400 VUs, 48904 complete and 0 interrupted iterations
mixed_traffic   [  88% ] 015/400 VUs  2m55.6s/3m20.0s

running (3m00.0s), 015/400 VUs, 48931 complete and 0 interrupted iterations
mixed_traffic   [  88% ] 015/400 VUs  2m56.6s/3m20.0s

running (3m01.0s), 015/400 VUs, 48959 complete and 0 interrupted iterations
mixed_traffic   [  89% ] 015/400 VUs  2m57.6s/3m20.0s

running (3m02.0s), 015/400 VUs, 48986 complete and 0 interrupted iterations
mixed_traffic   [  89% ] 015/400 VUs  2m58.6s/3m20.0s

running (3m03.0s), 015/400 VUs, 49015 complete and 0 interrupted iterations
mixed_traffic   [  90% ] 015/400 VUs  2m59.6s/3m20.0s

running (3m04.0s), 015/400 VUs, 49037 complete and 0 interrupted iterations
mixed_traffic   [  90% ] 015/400 VUs  3m00.6s/3m20.0s

running (3m05.0s), 015/400 VUs, 49062 complete and 0 interrupted iterations
mixed_traffic   [  91% ] 015/400 VUs  3m01.6s/3m20.0s

running (3m06.0s), 014/400 VUs, 49089 complete and 0 interrupted iterations
mixed_traffic   [  91% ] 014/400 VUs  3m02.6s/3m20.0s

running (3m07.0s), 013/400 VUs, 49111 complete and 0 interrupted iterations
mixed_traffic   [  92% ] 013/400 VUs  3m03.6s/3m20.0s

running (3m08.0s), 012/400 VUs, 49130 complete and 0 interrupted iterations
mixed_traffic   [  92% ] 012/400 VUs  3m04.6s/3m20.0s

running (3m09.0s), 012/400 VUs, 49151 complete and 0 interrupted iterations
mixed_traffic   [  93% ] 012/400 VUs  3m05.6s/3m20.0s

running (3m10.0s), 011/400 VUs, 49170 complete and 0 interrupted iterations
mixed_traffic   [  93% ] 011/400 VUs  3m06.6s/3m20.0s

running (3m11.0s), 010/400 VUs, 49188 complete and 0 interrupted iterations
mixed_traffic   [  94% ] 010/400 VUs  3m07.6s/3m20.0s

running (3m12.0s), 010/400 VUs, 49204 complete and 0 interrupted iterations
mixed_traffic   [  94% ] 010/400 VUs  3m08.6s/3m20.0s

running (3m13.0s), 009/400 VUs, 49218 complete and 0 interrupted iterations
mixed_traffic   [  95% ] 009/400 VUs  3m09.6s/3m20.0s

running (3m14.0s), 008/400 VUs, 49233 complete and 0 interrupted iterations
mixed_traffic   [  95% ] 008/400 VUs  3m10.6s/3m20.0s

running (3m15.0s), 008/400 VUs, 49245 complete and 0 interrupted iterations
mixed_traffic   [  96% ] 008/400 VUs  3m11.6s/3m20.0s

running (3m16.0s), 006/400 VUs, 49256 complete and 0 interrupted iterations
mixed_traffic   [  96% ] 006/400 VUs  3m12.6s/3m20.0s

running (3m17.0s), 006/400 VUs, 49270 complete and 0 interrupted iterations
mixed_traffic   [  97% ] 006/400 VUs  3m13.6s/3m20.0s

running (3m18.0s), 005/400 VUs, 49279 complete and 0 interrupted iterations
mixed_traffic   [  97% ] 005/400 VUs  3m14.6s/3m20.0s

running (3m19.0s), 004/400 VUs, 49286 complete and 0 interrupted iterations
mixed_traffic   [  98% ] 004/400 VUs  3m15.6s/3m20.0s

running (3m20.0s), 003/400 VUs, 49290 complete and 0 interrupted iterations
mixed_traffic   [  98% ] 003/400 VUs  3m16.6s/3m20.0s

running (3m21.0s), 003/400 VUs, 49294 complete and 0 interrupted iterations
mixed_traffic   [  99% ] 003/400 VUs  3m17.6s/3m20.0s

running (3m22.0s), 002/400 VUs, 49299 complete and 0 interrupted iterations
mixed_traffic   [  99% ] 002/400 VUs  3m18.6s/3m20.0s

running (3m23.0s), 001/400 VUs, 49301 complete and 0 interrupted iterations
mixed_traffic   [ 100% ] 001/400 VUs  3m19.6s/3m20.0s

running (3m24.0s), 001/400 VUs, 49302 complete and 0 interrupted iterations
mixed_traffic ↓ [ 100% ] 001/400 VUs  3m20s


  █ THRESHOLDS 

    unexpected_errors
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 78370  383.834774/s
    checks_succeeded...: 69.90% 54785 out of 78370
    checks_failed......: 30.09% 23585 out of 78370

    ✓ setup: admin login 200
    ✓ setup: product created 201
    ✓ setup: stock set 200
    ✓ browse: list 200
    ✓ browse: get by id 200
    ✗ order_journey: signup 201
      ↳  7% — ✓ 1104 / ✗ 13669
    ✗ order_journey: login 200
      ↳  15% — ✓ 175 / ✗ 929
    ✗ order_journey: place order 201
      ↳  99% — ✓ 174 / ✗ 1
    ✓ order_journey: get order 200
    ✓ order_journey: list my orders 200
    ✓ order_journey: cancel 204 or 409
    ✗ repeat_login: login 200
      ↳  2% — ✓ 219 / ✗ 7267
    ✓ repeat_login: list orders 200
    ✗ admin_ops: list all orders 200
      ↳  64% — ✓ 3104 / ✗ 1719
    ✓ admin_ops: notification log 200

    CUSTOM
    flow_admin_ops_duration........: avg=17.07ms  min=3ms      med=16ms     p(90)=31ms    p(95)=41ms     p(99)=70ms     max=128ms
    flow_browse_duration...........: avg=7.36ms   min=2ms      med=4ms      p(90)=14ms    p(95)=25ms     p(99)=50ms     max=165ms
    flow_order_journey_duration....: avg=698.66ms min=646ms    med=665ms    p(90)=746.6ms p(95)=870.49ms p(99)=1.28s    max=1.77s
    flow_repeat_login_duration.....: avg=369.22ms min=310ms    med=332ms    p(90)=395.8ms p(95)=557.69ms p(99)=1.17s    max=1.54s
    orders_created.................: 174    0.852204/s
    unexpected_errors..............: 0.00%  0 out of 78367

    HTTP
    http_req_duration..............: avg=11.22ms  min=423µs    med=1.96ms   p(90)=11.18ms p(95)=18.47ms  p(99)=317.3ms  max=1.53s
      { expected_response:true }...: avg=15.23ms  min=875µs    med=2.32ms   p(90)=13.94ms p(95)=23.9ms   p(99)=323.24ms max=1.53s
    http_req_failed................: 30.09% 23585 out of 78380
    http_reqs......................: 78380  383.883751/s

    EXECUTION
    iteration_duration.............: avg=466.9ms  min=200.78ms med=461.81ms p(90)=664.2ms p(95)=690.26ms p(99)=932.36ms max=2.07s
    iterations.....................: 49303  241.472577/s
    vus............................: 1      min=0              max=400
    vus_max........................: 400    min=400            max=400

    NETWORK
    data_received..................: 181 MB 888 kB/s
    data_sent......................: 19 MB  94 kB/s



running (3m24.2s), 000/400 VUs, 49303 complete and 0 interrupted iterations
mixed_traffic ✓ [ 100% ] 000/400 VUs  3m20s